STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/app_ble.c
              bleAppContext.deviceServerFound = 0x01;
              
              LOG_INFO_APP("-- COC peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                              bleAppContext.a_deviceServerBdAddr[5],
                              bleAppContext.a_deviceServerBdAddr[4],
                              bleAppContext.a_deviceServerBdAddr[3],
                              bleAppContext.a_deviceServerBdAddr[2],
                              bleAppContext.a_deviceServerBdAddr[1],
                              bleAppContext.a_deviceServerBdAddr[0]);
              found_status = 1;
            }
            else
            {
              LOG_INFO_APP("-- COC peripheral not detected\n");
            }
            
          }
          break;
        default:
          break;
        }/* end of switch*/
      
      i += ad_length + 1; /* increment the iterator to go on next element*/
      /*
      if (found_status != 0)
      {
        break;
      }
      */
    }/* end of while*/
  }
  
  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;
  

  if (bleAppContext.deviceServerFound != 0)
  {    
    result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                       GAP_PUBLIC_ADDR, 
                                       &bleAppContext.a_deviceServerBdAddr[0],
                                       GAP_PUBLIC_ADDR,
                                       CONN_INT_MS(50u), CONN_INT_MS(50u),
                                       0u,
                                       CONN_SUP_TIMEOUT_MS(5000u),
                                       CONN_CE_LENGTH_MS(50u), CONN_CE_LENGTH_MS(50u));      
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      LOG_INFO_APP("==>> Success: Create connection to SC_WBAxx\n");
      UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_CONNECTION_COMPLETE);
      
    }
    else
    {
      LOG_INFO_APP("==>> Fail: Create connection to SC_WBAxx , result: 0x%02X\n", result);
      BSP_LED_On(LED_RED);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }      
  }
  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      memcpy( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  UNUSED(ptr);
  UNUSED(size);

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

static void Scan_Request(void)
{
  tBleStatus result;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    BSP_LED_On(LED_BLUE);

    result = aci_gap_start_general_discovery_proc(SCAN_INT_MS(500), 
                                                  SCAN_WIN_MS(500), 
                                                  CFG_BD_ADDRESS_TYPE, 1);
    if (result == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("** START GENERAL DISCOVERY (SCAN) **\n");
    }
    else
    {
      BSP_LED_On(LED_RED);
      LOG_INFO_APP("-- BLE_App_Start_Limited_Disc_Req, Failed 0x%02X\n", result);
    }
  }
  BleStackCB_Process();

  return;
}

static void Central_security_request(void)
{
  tBleStatus status;
  status = aci_gap_send_pairing_req(bleAppContext.BleApplicationContext_legacy.connectionHandle, 0x00);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Pairing request cmd failure: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("Pairing request cmd success\n");
  }
  BleStackCB_Process();
}

static void Central_conn_interv_update(void)
{
  tBleStatus status;
  uint32_t paramA, paramB, paramC, paramD, paramE, paramF;
  paramC = 0x0000;
  paramD = 0x01F4;

  if (bleAppContext.connIntervalFlag != 0)
  {
    bleAppContext.connIntervalFlag = 0;
    paramA = CONN_INT_MS(11.25);
    paramB = CONN_INT_MS(11.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(11.25);
  }
  else
  {
    bleAppContext.connIntervalFlag = 1;
    paramA = CONN_INT_MS(26.25);
    paramB = CONN_INT_MS(26.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(26.25);
  }
    
  status = aci_gap_start_connection_update(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                           paramA,
                                           paramB,
                                           paramC,
                                           paramD,
                                           paramE,
                                           paramF);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gap_start_connection_update() Failed, status 0x%02X\n",status);
  }
  else
  {
    LOG_INFO_APP("aci_gap_start_connection_update(), Successfully\n");
  }
  BleStackCB_Process();
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1<<CFG_TASK_START_SCAN_ID, CFG_SEQ_PRIO_0);
  }
  else
  {    
    if (real_time == 0)
    {
      real_time = 1;
      LOG_INFO_APP("Real time mode\n");
    }
    else
    {
      real_time = 0;
      LOG_INFO_APP("Send data mode \n");
    }  
  }
  return;
}

void APPE_Button2Action(void)
{
  tBleStatus status;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    status = aci_gap_clear_security_db();
    if (status != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Clear security DB cmd failure: 0x%02X\n", status);
    }
    else
    {
      LOG_INFO_APP("Clear security DB cmd success\n");
    }
  }
  else
  {
    LOG_INFO_APP("**SECURITY REQ \n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_CENTRAL_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  return;
}

void APPE_Button3Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
  }
  else
  {
    LOG_INFO_APP("**CONN INTERVAL TOGGLE\n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_CENTRAL_CONN_INTERV_UPDATE_ID, CFG_SEQ_PRIO_0);
  }
  return;
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
